const telugify = (err) => {

  const err_data = {
    400: "ఏరా! నువ్వు పంపిన రిక్వెస్ట్ అర్థం కావట్లేదురా, సరిగా చెయ్యి!",
    401: "సరే రా, లాగిన్ చేయలేదు కదురా, అందుకే యాక్సెస్ లేదు!",
    403: "ఏరా! నువ్వు ఈ జాగా అడుగు పెట్టలేరు రా, అడ్డా లేదురా!",
    404: "ఏమిటి రా! {resource} ఇక్కడ ఎక్కడా కనబడట్లేదు రా!",
    405: "ఈ రూట్ మీద {method} చేయలేం రా, డాక్యుమెంటేషన్ చూడరా!",
    408: "ఏం సార్! నీ రిక్వెస్ట్ టైమ్ అవుట్ అయిపోయింది రా, ఇంకోసారి ట్రై చెయ్యి.",
    409: "ఒక్కటే డేటాను రెండు సార్లు పోగొట్టడానికే ప్రయత్నించావా రా?",
    422: "ఏరా! సరిగ్గా డేటా పంపి చెయ్యరా! ఇక్కడా తలకిందులు అయిపోయింది!",
    429: "అబ్బో! సర్వర్ మీద బాగా హడావిడి చేసావురా, కాస్త ఆగు!",
    500: "సర్వర్ గుండెల మీద భారంగా ఉంది రా, ఇబ్బంది పెట్టవద్దు!",
    502: "సర్వర్ నుంచి మంచి సమాధానం రాలేదురా, ఇంకోసారి ప్రయత్నించు!",
    503: "ఇప్పుడు సర్వర్ పనిలో లేకపోతున్నది రా, కాస్త సమయం తీసుకో!",
    504: "సర్వర్ సమయం ఎక్కువ తీసుకుంటున్నది రా, ఇక్కడ ఇంకోసారి చెక్ చేయు!",
  };

  //   const err_data = {
  //     "400": "ఏమంటావు బాస్! రిక్వెస్ట్ సెట్ కాకుండా అడగడమేమిటి? గేమ్ తగ్గించు!",
  //     "401": "రా రా! లాగిన్ లేకుండా ఇలా దూకుతున్నావు, దొరుకుతావ్ రా!",
  //     "403": "ఓహో, నీకెందుకు యాక్సెస్ ఇక్కడ? పర్మిషన్ చూసి అడుగు బాస్!",
  //     "404": "అబ్బాయ్! ఈ {resource} గల్లీలో దొరకలేదు, సరి URL పంపు!",
  //     "405": "ఇది ఏ రూట్ మీద {method} కొడతావ్ రా? ఓనర్ ని అడుగు!",
  //     "408": "సిగ్గులేకుండా టైం తీసుకుని ఇంకోసారి ప్రయత్నించు బాస్!",
  //     "409": "ఒక్కటే ఐటమ్ మీద మళ్ళీ మళ్ళీ కొడతావ్, బ్యాలెన్స్ లేదురా!",
  //     "422": "డేటా సెట్ అయి పంపి ట్రై చెయ్యి బాస్! లాంగ్వేజ్ సరిగ్గా రాసవా?",
  //     "429": "అరె! సర్వర్ కి దిమ్మ తిరిగిపోతోంది, ట్రాఫిక్ తగ్గించు!",
  //     "500": "సర్వర్ పంచ్ మిస్ అయ్యింది రా! ఎవడో గొడవ చేసినట్లు ఉంది!",
  //     "502": "సిగ్నల్ వీక్ ఉంది బాస్, గేట్‌వే సరిగా పనిచేయట్లేదు!",
  //     "503": "ఇప్పుడు సర్వర్ ఫుల్ బిజీగా ఉంది రా, కాస్తంత ఆగరా!",
  //     "504": "సర్వర్ టైం తీసుకుంటుంది బాస్, నువ్వు కాస్త కూల్ అవ్వు!"
  //   }

  //   console.log('error',err.response.status);
  //   const error_status_num = err;
  const error_status_num = err.response.status;

  if (error_status_num in err_data) {
    return console.log(err_data[error_status_num]);
  } else {
    return console.log(err);
  }
};

module.exports = {telugify}
